Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions.ObjectType Property
 The object type. In result query the only supported type is the physical member (the part).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisResult.ObjectTypeEnum ObjectType { get; set; }
Public Property ObjectType As AnalysisResult.ObjectTypeEnum
	Get
	Set
Property Value
Type: AnalysisResult.ObjectTypeEnum
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace